<?php
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------

return [
    // 日志保存目录
    'path'        => '',
    // 日志通道名
    'channel'        => 'app',
    // 日志记录级别
    'level'       => 'debug',
    // 最大日志保留天数，超过删除 0无限制
    'max_files'   => 0,
    // 文件权限
    'file_permission' => 0666,
    //数据库记录级别
    'sql_level'  => 'info',
    // 是否关闭日志写入
    'close'       => false,
];
